base-devel
networkmanager
bluez
blueman
pipewire
pipewire-alsa
pipewire-pulse
wireplumber
pavucontrol
easyeffects
libnotify
polkit
polkit-gnome
sddm
xorg-xwayland
waybar
rofi
fuzzel
dunst
swaybg
swaylock
clipmenu
pamixer
xcolor
alacritty
kitty
zsh
starship
zoxide
fzf
ripgrep
fd
bat
tree
git
curl
wget
httpie
jq
rsync
wl-clipboard
xclip
playerctl
brightnessctl
xdg-utils
fastfetch
btop
pass
pwgen
yt-dlp
ffmpeg
imagemagick
libvips
strawberry
obs-studio
mpv
imv
qview
feh
ranger
thunar
thunar-archive-plugin
thunar-volman
tumbler
catfish
exo
ffmpegthumbnailer
gnome-epub-thumbnailer
file-roller
zip
unzip
unrar
p7zip
tar
bzip2
firefox
vivaldi
lynx
code
evince
libreoffice-fresh
hunspell
hunspell-en_us
hunspell-ru
calibre
xournalpp
thunderbird
telegram-desktop
qbittorrent
network-manager-applet
gcolor3
openscad
krita
steam
gamemode
mangohud
wine-staging
winetricks
dxvk
vkd3d
vulkan-tools
vulkan-headers
vulkan-icd-loader
vulkan-validation-layers
glslang
spirv-tools
# nvidia-open
# nvidia-utils
# lib32-nvidia-utils
noto-fonts
noto-fonts-cjk
noto-fonts-emoji
ttf-carlito
ttf-inconsolata
ttf-font-awesome
ttf-liberation
ttf-dejavu
cantarell-fonts
gnu-free-fonts
papirus-icon-theme
adwaita-icon-theme
bibata-cursor-theme
python
python-pip
pyright
ruff
clang
gcc
cmake
ccls
rustup
rust-analyzer
go
gopls
delve
golangci-lint
templ
jdk21-openjdk
lua
luajit
lua-language-server
stylua
nodejs
typescript-language-server
tailwindcss-language-server
svelte-language-server
yaml-language-server
bash-language-server
shellcheck
shfmt
taplo
sqls
sqlite
pgadmin4
dbeaver
protobuf
protoc-gen-go
protoc-gen-go-grpc
kubectl
helm
terraform
ansible
glab
docker
docker-compose
qemu-full
libvirt
virt-manager
spice-vdagent
virtualbox
virtualbox-host-modules-arch
waydroid
neovim
